Repository: desmos-labs/dam
Catalog: lib/l10n/app_*.arb
Languages: it

# welcome
source: Welcome to Desmos
it: Benvenuti su Desmos network

# importMnemonic
source: Import mnemonic phrase and generate address
it: Importa account

# generateAccount
source: Generate new address
it: Genera account

# generateAccountPageTitle
source: Generate address(es)
it: Genera un account

# writeSaveMnemonic
source: Please write down and save your mnemonic phrase.
it: Ricoardati di scrivere la mnemonic phrase su un pezzo di carta.

# onlyWayRestore
source: It's the %s to restore the address.
it: E' l'%s di ripristinare l'account.

source: only way
it: unico modo

source: Random
it: Casuale

# accountGenerated
source: Desmos address(es) generated successfully
it: L'account di Desmos Ã¨ stato generato con successo

source: Desmos address
it: Indirizzo Desmos

# textCopied
source: Text copied inside the clipboard
it: Testo copiato negli appunti

# importMnemonicPageTitle
source: Import mnemonic phrase
it: Importa mnemonic phrase

# importMnemonicBody
source: Make sure you enter your mnemonic phrase in order and that each word is written correctly.
it: Per favore, inserisci la mnemonic phrase in ordine e assicurati che ogni parola sia scritta correttamente

# nextButtonText
source: Next
it: Avanti

# mnemonicNotValidError
source: Mnemonic is not valid
it: Mnemonic errato

source: Loading...
it: Caricamento...
